org/_posts/2011-09-27-testing-cascalog-with-midje.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: Testing Cascalog with Midje
---

<p class="meta">27 Sept 2011 - San Francisco</p>
#+END_HTML

* Testing Cascalog with Midje

One of the most exciting advantages Cascalog holds over Pig and Hive is its expressive power; Clojure is truly a wonder in that regard. One particular problem with other current MapReduce abstraction layers is the utter difficulty of testing queries and workflows. End-to-end tests are maddening to craft in pure MapReduce and frustrating at best in Pig and Hive.

I've been working on a Cascalog testing suite these past few weeks, an extension to Brian Marick's Midje, that solves the problems of testing MapReduce workflows.

** Functional MapReduce Testing

I'll start with an example cascalog query:

#+begin_src clojure
  (defn max-followers-query [datastore-path]
    (let [src (name-vars (complex-subquery datastore-path)
                         ["?user" "?followers"])]
      (c/first-n src 1 :sort ["?followers"] :reverse true)))
#+end_src

=complex-subquery= generates 2-tuples of the form =[user, follower-count]=. =max-followers-query= is only responsible for pulling the tuples with the most =?followers=.

Let's pretend that you were writing this in MapReduce. How would you run tests against this job?

- MapReduce jobs require a specific FileInputFormat, so you'd start by creating a temporary directory, serializing some test data and passing it into a tempfile in the proper InputFormat.
- Next, execute the job on that tempfile and funnel its results into another temp directory.
- Extract each k-v pair, deserialize and run the results through your test code
- destroy temporary files and directories.

Any test of application logic is dwarfed by the maintenance required. Most real world MapReduce applications involved chained jobs, a nightmare to test using the above methods. Perhaps for this reason, [[http://www.cloudera.com/blog/2009/07/debugging-mapreduce-programs-with-mrunit/][Cloudera]] recommends testing mappers and reducers separately, one tuple at a time:

#+begin_quote
/many errors can be quickly identified with small tests involving a single, well-chosen input record./
#+end_quote

This is insane. Imagine writing a complex function responsible for heavy IO, and testing an internal for-loop with one well-chosen integer.

A well designed testing suite will test each MapReduce query against a range of input data, in addition to testing full flows and compositions of queries.

With Midje (and my extension, [[https://github.com/sritchie/midje-cascalog][midje-cascalog]]), you can obliterate the complexity of testing =max-followers-query= by mocking out the result of =complex-subquery=  to return a Clojure data structure:

#+begin_src clojure
  (fact?- "Query should return 1 tuple with the most popular user +
          follower count."
          [["richhickey" 2961]]
          (max-followers-query :path)
          (provided
            (complex-subquery :path) => [["sritchie09" 180]
                                         ["richhickey" 2961]]))
  
#+end_src

This test, or "fact", states that

- when =max-followers-query= is called with the argument =:path=,
- it will produce =[ [ richhickey" 2961] ]=,
- Provided =(complex-subquery :path)= produces =[["sritchie09" 180] ["richhickey" 2961]]=.

The application logic here is completely separate from filesystem IO. The test examines a single query, and proves it to be correct for all expected inputs. Tests like this are the building blocks of rock-solid production apps.

Midje gives you the power to test logical units of MapReduce code with full freedom from filesystem details, a feat unprecedented in the big data world. Let's get an example project set up and do some testing.

** Setting Up your Environment

*** Midje

Midje is an incredible testing framework by Brian Marick. It supports a number of [[https://github.com/marick/Midje/wiki/Checkers-for-collections-and-strings][collection checkers]], and allows for intuitive mocking of clojure functions and vars. I've extended Midje with [[https://github.com/sritchie/midje-cascalog][a few macros]] that mirror cascalog's query execution syntax: =fact?-= vs =?-=, =fact?<-= vs =?<-=.

*** Example Project

You can find all source code from this post [[https://github.com/sritchie/cascalog-testing-demo][on github]]. To add =midje-cascalog= support to your own project, add these entries to =:dev-dependencies=:

#+begin_src clojure
[lein-midje "1.0.3"]
[midje-cascalog "0.2.0"]
#+end_src
 
