_posts/2011-09-27-testing-cascalog-with-midje.html
---
layout: post
title: Testing Cascalog with Midje
---

<p class="meta">27 Sept 2011 - San Francisco</p>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Testing Cascalog with Midje </h2>
<div class="outline-text-2" id="text-1">


<p>
One of the most exciting advantages Cascalog holds over Pig and Hive is its expressive power; Clojure is truly a wonder in that regard. One particular problem with other current MapReduce abstraction layers is the utter difficulty of testing queries and workflows. End-to-end tests are maddening to craft in pure MapReduce and frustrating at best in Pig and Hive.
</p>
<p>
I've been working on a Cascalog testing suite these past few weeks, an extension to Brian Marick's Midje, that solves the problems of testing MapReduce workflows.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Functional MapReduce Testing </h3>
<div class="outline-text-3" id="text-1-1">


<p>
I'll start with an example cascalog query:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">max-followers-query</span> [datastore-path]
  <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src <span style="color: #8c8c8c;">(</span>name-vars <span style="color: #8c8c8c;">(</span>complex-subquery datastore-path<span style="color: #8c8c8c;">)</span>
                       [<span style="color: #8b2252;">"?user"</span> <span style="color: #8b2252;">"?followers"</span>]<span style="color: #8c8c8c;">)</span>]
    <span style="color: #8c8c8c;">(</span>c/first-n src 1 <span style="color: #008b8b;">:sort</span> [<span style="color: #8b2252;">"?followers"</span>] <span style="color: #008b8b;">:reverse</span> true<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
<code>complex-subquery</code> generates 2-tuples of the form <code>[user, follower-count]</code>. <code>max-followers-query</code> is only responsible for pulling the tuples with the most <code>?followers</code>.
</p>
<p>
Let's pretend that you were writing this in MapReduce. How would you run tests against this job?
</p>
<ul>
<li>MapReduce jobs require a specific FileInputFormat, so you'd start by creating a temporary directory, serializing some test data and passing it into a tempfile in the proper InputFormat.
</li>
<li>Next, execute the job on that tempfile and funnel its results into another temp directory.
</li>
<li>Extract each k-v pair, deserialize and run the results through your test code
</li>
<li>destroy temporary files and directories.
</li>
</ul>


<p>
Any test of application logic is dwarfed by the maintenance required. Most real world MapReduce applications involved chained jobs, a nightmare to test using the above methods. Perhaps for this reason, <a href="http://www.cloudera.com/blog/2009/07/debugging-mapreduce-programs-with-mrunit/">Cloudera</a> recommends testing mappers and reducers separately, one tuple at a time:
</p>
<blockquote>

<p><i>many errors can be quickly identified with small tests involving a single, well-chosen input record.</i>
</p>
</blockquote>


<p>
This is insane. Imagine writing a complex function responsible for heavy IO, and testing an internal for-loop with one well-chosen integer.
</p>
<p>
A well designed testing suite will test each MapReduce query against a range of input data, in addition to testing full flows and compositions of queries.
</p>
<p>
With Midje (and my extension, <a href="https://github.com/sritchie/midje-cascalog">midje-cascalog</a>), you can obliterate the complexity of testing <code>max-followers-query</code> by mocking out the result of <code>complex-subquery</code>  to return a Clojure data structure:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"Query should return 1 tuple with the most popular user +</span>
<span style="color: #8b2252;">        follower count."</span>
        [[<span style="color: #8b2252;">"richhickey"</span> 2961]]
        <span style="color: #8c8c8c;">(</span>max-followers-query <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>complex-subquery <span style="color: #008b8b;">:path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"sritchie09"</span> 180]
                                       [<span style="color: #8b2252;">"rickhickey"</span> 2961]]<span style="color: #8c8c8c;">))</span>

</pre>


<p>
This test, or "fact", states that
</p>
<ul>
<li>when <code>max-followers-query</code> is called with the argument <code>:path</code>,
</li>
<li>it will produce <code>[ [ richhickey" 2961] ]</code>,
</li>
<li>Provided <code>(complex-subquery :path)</code> produces <code>[["sritchie09" 180] ["rickhickey" 2961]]</code>.
</li>
</ul>


<p>
The application logic here is completely separate from filesystem IO. The test examines a single query, and proves it to be correct for all expected inputs. Tests like this are the building blocks of rock-solid production apps.
</p>
<p>
Midje gives you the power to test logical units of MapReduce code with full freedom from filesystem details, a feat unprecedented in the big data world. Let's get an example project set up and do some testing.
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Setting Up your Environment </h3>
<div class="outline-text-3" id="text-1-2">



</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Midje </h4>
<div class="outline-text-4" id="text-1-2-1">


<p>
Midje is an incredible testing framework by Brian Marick. It supports a number of <a href="https://github.com/marick/Midje/wiki/Checkers-for-collections-and-strings">collection checkers</a>, and allows for intuitive mocking of clojure functions and vars. I've extended Midje with <a href="https://github.com/sritchie/midje-cascalog">a few macros</a> that mirror cascalog's query execution syntax: <code>fact?-</code> vs <code>?-</code>, <code>fact?&lt;-</code> vs <code>?&lt;-</code>.
</p>
</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Example Project </h4>
<div class="outline-text-4" id="text-1-2-2">


<p>
You can find all source code from this post <a href="https://github.com/sritchie/cascalog-testing-demo">on github</a>. To add <code>midje-cascalog</code> support to your own project, add these entries to <code>:dev-dependencies</code>:
</p>



<pre class="src src-clojure">[lein-midje <span style="color: #8b2252;">"1.0.3"</span>]
[midje-cascalog <span style="color: #8b2252;">"0.2.0"</span>]
</pre>


</div>
</div>

</div>
