org/_posts/2011-09-27-testing-cascalog-with-midje.org
** Cascalog Queries

Let's start by fleshing out word counting in Cascalog.

#+begin_src clojure
  (ns cascalog.testing-demo.core
    (:use cascalog.api)
    (:require [cascalog.ops :as c])
    (:gen-class))
    
  (defmapcatop split
    "Accepts a sentence, splits on whitespace, and emits a single
    1-tuple for each word."
    [^String sentence]
    (seq (.split sentence "\\s+")))
  
  (defn wc-query
    "Returns a subquery that generates wordcounts for every word in
      the textfiles located at `text-path`."
    [text-path]
    (let [src (hfs-textline text-path)]
      (<- [?word ?count]
          (src ?textline)
          (split ?textline :> ?word)
          (c/count ?count))))
    
  (defn -main
    "Accepts a path to a number of text files and a results path, and
     prints each distinct word along with its count to an `hfs-textline`
     tap at `results-path`."
    [text-path results-path]
    (?- (hfs-textline results-path)
        (wc-query text-path)))
#+end_src

=wc-query= takes a path to some directory containing textfiles, and returns a query that produces =[word count]= pairs. =-main= executes this query into another textfile.

The project's application logic lies in =wc-query=. Testing =wc-query= in isolation is difficult, as =wc-query= takes a path meant for =hfs-textline=, rather than accepting a tuple source directly. How can we test this, without rewriting the query?

The solution lies in Midje's mocking support. Let's build up to this by going over some basic fact-based cascalog tests.

** Basic Cascalog Testing

Let's put our tests in =./test/cascalog/testing_demo/core_test.clj= (mirroring the =core.clj=, with =_test= tacked on):

#+begin_src clojure
  (ns cascalog.testing-demo.core-test
    (:use cascalog.testing-demo.core
          cascalog.api
          [midje sweet cascalog])
    (:require [cascalog.ops :as c]))
#+end_src

*** fact?- 

=fact?-= accepts pairs of result-tuple-sequences and queries:

#+begin_src clojure
  (fact?- [[1 2]] (<- [?a ?b]
                      ([[1]] ?a)
                      (inc ?a :> ?b))
  
          [[3 4]] (<- [?a ?b]
                      ([[4]] ?b)
                      (dec ?b :> ?a)))
#+end_src

The above code states two distinct "facts" about our data. Each query (on the right), when executed, produces the sequence of tuples (to its left). Ordering of result tuples doesn't matter.

The following form is also valid:

#+begin_src clojure
  (defn some-query [src]
    (<- [?a ?b]
        (src ?a)
        (inc ?a :> ?b)))
  
  (fact?- :info
          "Strings are fine anywhere!"
          [[1 2]] (some-query [[1]]))
#+end_src

The first keyword sets a custom log level; in the absence of this keyword. The log level defaults to =:fatal=. (See [[https://github.com/nathanmarz/cascalog/blob/master/src/clj/cascalog/io.clj#L59][cascalog.util]] for all other options).

*** fact?<- 

=fact?<-= is analogous to =?<-=, in that it defines single query and tests it within the same form.

#+begin_src clojure
(fact?<- [[1 2]]
         [?a ?b]
         ([[1]] ?a)
         (inc ?a :> ?b))
#+end_src

This fact defines a query that produces 2-tuples of the form =[?a ?b]=, and tests that it generates =[ [1 2] ]= on execution.

I find =fact?<-= useful mostly for testing how =def*op= functions behave inside of queries. =fact?-= is broadly useful for testing full queries and workflows, and shows up in far more tests.

*** future-fact?- and future-fact?<-

If you want to stub out an unfinished test, use any of the following in place of the two macros above:

- =future-fact?-= and =future-fact?<-=
- =pending-fact?-= and =pending-fact?<-=

This will prevent the body of the fact from being evaluated. (The =future-fact= and =pending-fact= forms are identical. Midje provides [[https://github.com/marick/Midje/wiki/Future-facts][more information here]].)

*** lein-midje

Once you write all these tests, how to run them? If you're using leiningen, add =[lein-midje "1.0.3"]= to your =project.clj=, and run =lein midje= in your project directory. This will run all facts and tests in the project and print a summary of results to stdout. (Here's the [[https://github.com/marick/Midje/wiki/Lein-midje][github page]] for lein-midje.)

*** Interaction with clojure.test

If you're currently using clojure.test, check out [[https://github.com/marick/Midje/wiki/Migrating-from-clojure.test][Midje's tips]] on integration. The two modes work very well together. =lein midje= will evaulate all =deftest= forms inside of a project, and include the results in its report.

** Mocking

Let's revisit =wc-query= from =cascalog.testing-demo.core=. Here's an initial test, mocked out with =fact?-=:

#+begin_src clojure
  (fact?- "wc-query should count words from all lines of text at
          /path/to/textfile."
          result-vec (wc-query "/path/to/textfile"))
#+end_src

=wc-query=, as written, performs an internal call to =hfs-textline=. =hfs-textline= provides with tuples from the filesystem, and as such has no direct place in our logic tests.

