_posts/2011-09-27-testing-cascalog-with-midje.html

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Cascalog Queries </h3>
<div class="outline-text-3" id="text-1-3">


<p>
Let's start by fleshing out word counting in Cascalog.
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">ns</span> cascalog.testing-demo.core
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:use</span> cascalog.api<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:require</span> [cascalog.ops <span style="color: #008b8b;">:as</span> c]<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:gen-class</span><span style="color: #8c8c8c;">))</span>

<span style="color: #8c8c8c;">(</span>defmapcatop split
  <span style="color: #8b2252;">"Accepts a sentence, splits on whitespace, and emits a single</span>
<span style="color: #8b2252;">  1-tuple for each word."</span>
  [<span style="color: #228b22;">^String</span> sentence]
  <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">seq</span> <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">.split</span> sentence <span style="color: #8b2252;">"\\s+"</span><span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">wc-query</span>
  <span style="color: #8b2252;">"Returns a subquery that generates wordcounts for every word in</span>
<span style="color: #8b2252;">    the textfiles located at `text-path`."</span>
  [text-path]
  <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">let</span> [src <span style="color: #8c8c8c;">(</span>hfs-textline text-path<span style="color: #8c8c8c;">)</span>]
    <span style="color: #8c8c8c;">(</span>&lt;- [?word ?count]
        <span style="color: #8c8c8c;">(</span>src ?textline<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>split ?textline <span style="color: #008b8b;">:&gt;</span> ?word<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>c/count ?count<span style="color: #8c8c8c;">))))</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">-main</span>
  <span style="color: #8b2252;">"Accepts a path to a number of text files and a results path, and</span>
<span style="color: #8b2252;">   prints each distinct word along with its count to an `hfs-textline`</span>
<span style="color: #8b2252;">   tap at `results-path`."</span>
  [text-path results-path]
  <span style="color: #8c8c8c;">(</span>?- <span style="color: #8c8c8c;">(</span>hfs-textline results-path<span style="color: #8c8c8c;">)</span>
      <span style="color: #8c8c8c;">(</span>wc-query text-path<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
<code>wc-query</code> takes a path to some directory containing textfiles, and returns a query that produces <code>[word count]</code> pairs. <code>-main</code> executes this query into another textfile.
</p>
<p>
The project's application logic lies in <code>wc-query</code>. Testing <code>wc-query</code> in isolation is difficult, as <code>wc-query</code> takes a path meant for <code>hfs-textline</code>, rather than accepting a tuple source directly. How can we test this, without rewriting the query?
</p>
<p>
The solution lies in Midje's mocking support. Let's build up to this by going over some basic fact-based cascalog tests.
</p>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4">Basic Cascalog Testing </h3>
<div class="outline-text-3" id="text-1-4">


<p>
Let's put our tests in <code>./test/cascalog/testing_demo/core_test.clj</code> (mirroring the <code>core.clj</code>, with <code>_test</code> tacked on):
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">ns</span> cascalog.testing-demo.core-test
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:use</span> cascalog.testing-demo.core
        cascalog.api
        [midje sweet cascalog]<span style="color: #8c8c8c;">)</span>
  <span style="color: #8c8c8c;">(</span><span style="color: #008b8b;">:require</span> [cascalog.ops <span style="color: #008b8b;">:as</span> c]<span style="color: #8c8c8c;">))</span>
</pre>



</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1">fact?- </h4>
<div class="outline-text-4" id="text-1-4-1">


<p>
<code>fact?-</code> accepts pairs of result-tuple-sequences and queries:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- [[1 2]] <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
                    <span style="color: #8c8c8c;">(</span>[[1]] ?a<span style="color: #8c8c8c;">)</span>
                    <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">))</span>

        [[3 4]] <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
                    <span style="color: #8c8c8c;">(</span>[[4]] ?b<span style="color: #8c8c8c;">)</span>
                    <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">dec</span> ?b <span style="color: #008b8b;">:&gt;</span> ?a<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
The above code states two distinct "facts" about our data. Each query (on the right), when executed, produces the sequence of tuples (to its left). Ordering of result tuples doesn't matter.
</p>
<p>
The following form is also valid:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">defn</span> <span style="color: #0000ff;">some-query</span> [src]
  <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
      <span style="color: #8c8c8c;">(</span>src ?a<span style="color: #8c8c8c;">)</span>
      <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">)))</span>

<span style="color: #8c8c8c;">(</span>fact?- <span style="color: #008b8b;">:info</span>
        <span style="color: #8b2252;">"Strings are fine anywhere!"</span>
        [[1 2]] <span style="color: #8c8c8c;">(</span>some-query [[1]]<span style="color: #8c8c8c;">))</span>
</pre>


<p>
The first keyword sets a custom log level; in the absence of this keyword. The log level defaults to <code>:fatal</code>. (See <a href="https://github.com/nathanmarz/cascalog/blob/master/src/clj/cascalog/io.clj#L59">cascalog.util</a> for all other options).
</p>
</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2">fact?&lt;- </h4>
<div class="outline-text-4" id="text-1-4-2">


<p>
<code>fact?&lt;-</code> is analogous to <code>?&lt;-</code>, in that it defines single query and tests it within the same form.
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?&lt;- [[1 2]]
         [?a ?b]
         <span style="color: #8c8c8c;">(</span>[[1]] ?a<span style="color: #8c8c8c;">)</span>
         <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">))</span>
</pre>


<p>
This fact defines a query that produces 2-tuples of the form <code>[?a ?b]</code>, and tests that it generates <code>[ [1 2] ]</code> on execution.
</p>
<p>
I find <code>fact?&lt;-</code> useful mostly for testing how <code>def*op</code> functions behave inside of queries. <code>fact?-</code> is broadly useful for testing full queries and workflows, and shows up in far more tests.
</p>
</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3">future-fact?- and future-fact?&lt;- </h4>
<div class="outline-text-4" id="text-1-4-3">


<p>
If you want to stub out an unfinished test, use any of the following in place of the two macros above:
</p>
<ul>
<li><code>future-fact?-</code> and <code>future-fact?&lt;-</code>
</li>
<li><code>pending-fact?-</code> and <code>pending-fact?&lt;-</code>
</li>
</ul>


<p>
This will prevent the body of the fact from being evaluated. (The <code>future-fact</code> and <code>pending-fact</code> forms are identical. Midje provides <a href="https://github.com/marick/Midje/wiki/Future-facts">more information here</a>.)
</p>
</div>

</div>

<div id="outline-container-1-4-4" class="outline-4">
<h4 id="sec-1-4-4">lein-midje </h4>
<div class="outline-text-4" id="text-1-4-4">


<p>
Once you write all these tests, how to run them? If you're using leiningen, add <code>[lein-midje "1.0.3"]</code> to your <code>project.clj</code>, and run <code>lein midje</code> in your project directory. This will run all facts and tests in the project and print a summary of results to stdout. (Here's the <a href="https://github.com/marick/Midje/wiki/Lein-midje">github page</a> for lein-midje.)
</p>
</div>

</div>

<div id="outline-container-1-4-5" class="outline-4">
<h4 id="sec-1-4-5">Interaction with clojure.test </h4>
<div class="outline-text-4" id="text-1-4-5">


<p>
If you're currently using clojure.test, check out <a href="https://github.com/marick/Midje/wiki/Migrating-from-clojure.test">Midje's tips</a> on integration. The two modes work very well together. <code>lein midje</code> will evaulate all <code>deftest</code> forms inside of a project, and include the results in its report.
</p>
</div>
</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5">Mocking </h3>
<div class="outline-text-3" id="text-1-5">


<p>
Let's revisit <code>wc-query</code> from <code>cascalog.testing-demo.core</code>. Here's an initial test, mocked out with <code>fact?-</code>:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"wc-query should count words from all lines of text at</span>
<span style="color: #8b2252;">        /path/to/textfile."</span>
        result-vec <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #8b2252;">"/path/to/textfile"</span><span style="color: #8c8c8c;">))</span>
</pre>


<p>
<code>wc-query</code>, as written, performs an internal call to <code>hfs-textline</code>. <code>hfs-textline</code> provides with tuples from the filesystem, and as such has no direct place in our logic tests.
</p>

</div>
