org/_posts/2011-09-27-testing-cascalog-with-midje.org
*** provided 

Mocking allows us to intercept all calls to =hfs-textline= and insert our own tuples. Using midje's =provided= form, this looks like:

#+begin_src clojure
  (def short-sentences
    [["this is a sentence sentence"]
     ["sentence with this is repeated"]])
  
  (def short-wordcounts
    [["sentence" 3]
     ["repeated" 1]
     ["is" 2]
     ["a" 1]
     ["this" 2]
     ["with" 1]])
  
  (fact?- "fact?- accepts `result-vec, query` pairs."
          short-wordcounts (wc-query :text-path)
          (provided
            (hfs-textline :text-path) => short-sentences))
#+end_src

This fact states that 

- when =wc-query= is called with =:text-path=
- it will produce =short-sentences=,
- Provided =(hfs-textline :text-path)= produces =short-wordcounts=.

=provided= forms only apply to the queries directly above. This won't work, as the first pair can't access the second pair's =provided= block:

#+begin_src clojure
  (fact?- results (some-query :a) ;; provided call won't apply here!
          
          results-2 (another-query :a) ;; only here.
          (provided
            (inner-func :a) => 10))
#+end_src

*** Nested Mocking

=(provided ... )= can also mock nested calls, as discussed [[https://github.com/marick/Midje/wiki/Folded-prerequisites][here]]. For example:

#+begin_src clojure
  (fact?- results (query :arg :arg2)
          (provided (f1 (f2 :arg)) => source-tuples
                    (f3 :arg2) => other-src))
#+end_src

This fact mocks out calls to =(f3 :arg2)= and =(f1 (f2 :arg1))=, and expects that both will show up somewhere within the body of =(query :arg :arg2)=.

I prefer keywords as mocking arguments, but strings, numbers, and any symbol surrounded by dots (like =..this..=) are all valid.

*** against-background

As discussed, the =provided= keyword only applies to the fact-pair directly above. it. As =fact?-= takes multiple forms, this can be limiting; What if you want to mock a function's results for all forms?

Midje solves this with =against-background=. Functions mocked within this form have lower precedence than =provided= mocking, but apply to all queries, as shown here:

#+begin_src clojure
  (fact?- "Same test as before, pulling mocking from against-background
          below."
          short-wordcounts
          (wc-query :text-path)
          
          "provided overrides against-background for the query directly
          above it."
          [["what" 1] ["a" 1] ["world!" 1]]
          (wc-query :text-path)
          (provided
            (hfs-textline :text-path) => [["what a world!"]])
          
          (against-background
            (hfs-textline :text-path) => short-sentences))
#+end_src

This power allows you to explore a range of query edge cases with a single mock.

** Collection Checkers

Executed queries return collections of data. =wc-query= will produce a rather large sequence of =<word, count>= pairs for a small number of input sentences. This is no reason to limit tests to small sentences!

Midje provides a range of collection checkers that provide you with finer control. (All collection checker options are documented [[https://github.com/marick/Midje/wiki/Checkers-for-collections-and-strings][here]].)

*** just

This is the default checker for =midje-cascalog=. Bare result vectors resolve to =(just result-vec :in-any-order)=. The following two facts are eqivalent:

#+begin_src clojure
(fact?- (just [[2 3] [1 2]] :in-any-order)
        (<- [?a ?b]
            ([[1] [2]] ?a)
            (inc ?a :> ?b))

        [[2 3] [1 2]]
        (<- [?a ?b]
            ([[1] [2]] ?a)
            (inc ?a :> ?b)))
#+end_src

Each of these facts checks that its subquery returns =[2 3]= =[1 2]= exclusively, in any order.

For the next set of facts, let's introduce a larger set of input sentences:

#+begin_src clojure
  (def longer-sentences
    [["Call me Ishmael. Some years ago -- never mind how long"]
     ["precisely -- having little or no money in my purse, and"]
     ["nothing particular to interest me on shore, I thought I"]
     ["would sail about a little and see the watery part of the world."]])
#+end_src

*** contains

The =contains= form, used as =(contains result-vec)=, tests that =result-vec= occurs, in order, somewhere within a query's results. The tuples in =result-vec= must be contiguous. (Using =contains= by itself really only make sense when querying for the top-n on some field, where the ordering is what's important.)

Adding the =:gaps-ok= keyword at the end of the form relaxes the contiguous requirement. Adding =:in-any-order=, or using a set for =result-vec=, relaxes the ordering restriction. For example:

#+begin_src clojure
  (fact?- (contains #{["sail" 1] ["Ishmael." 1]} :gaps-ok)
          (wc-query :text-path)
          (provided
            (hfs-textline :text-path) => longer-sentences))
#+end_src

The above fact tests that both =["sail" 1]= and =["Ishmael." 1]= appear somewhere in the results, in any order. (Note the set wrapping the result tuples.)

