_posts/2011-09-27-testing-cascalog-with-midje.html

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1">provided </h4>
<div class="outline-text-4" id="text-1-5-1">


<p>
Mocking allows us to intercept all calls to <code>hfs-textline</code> and insert our own tuples. Using midje's <code>provided</code> form, this looks like:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">def</span> <span style="color: #0000ff;">short-sentences</span>
  [[<span style="color: #8b2252;">"this is a sentence sentence"</span>]
   [<span style="color: #8b2252;">"sentence with this is repeated"</span>]]<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">def</span> <span style="color: #0000ff;">short-wordcounts</span>
  [[<span style="color: #8b2252;">"sentence"</span> 3]
   [<span style="color: #8b2252;">"repeated"</span> 1]
   [<span style="color: #8b2252;">"is"</span> 2]
   [<span style="color: #8b2252;">"a"</span> 1]
   [<span style="color: #8b2252;">"this"</span> 2]
   [<span style="color: #8b2252;">"with"</span> 1]]<span style="color: #8c8c8c;">)</span>

<span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"fact?- accepts `result-vec, query` pairs."</span>
        short-wordcounts <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; short-sentences<span style="color: #8c8c8c;">))</span>
</pre>


<p>
This fact states that 
</p>
<ul>
<li>when <code>wc-query</code> is called with <code>:text-path</code>
</li>
<li>it will produce <code>short-sentences</code>,
</li>
<li>Provided <code>(hfs-textline :text-path)</code> produces <code>short-wordcounts</code>.
</li>
</ul>


<p>
<code>provided</code> forms only apply to the queries directly above. This won't work, as the first pair can't access the second pair's <code>provided</code> block:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- results <span style="color: #8c8c8c;">(</span>some-query <span style="color: #008b8b;">:a</span><span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">provided call won't apply here!</span>

        results-2 <span style="color: #8c8c8c;">(</span>another-query <span style="color: #008b8b;">:a</span><span style="color: #8c8c8c;">)</span> <span style="color: #b22222;">;; </span><span style="color: #b22222;">only here.</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>inner-func <span style="color: #008b8b;">:a</span><span style="color: #8c8c8c;">)</span> =&gt; 10<span style="color: #8c8c8c;">))</span>
</pre>


</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2">Nested Mocking </h4>
<div class="outline-text-4" id="text-1-5-2">


<p>
<code>(provided ... )</code> can also mock nested calls, as discussed <a href="https://github.com/marick/Midje/wiki/Folded-prerequisites">here</a>. For example:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- results <span style="color: #8c8c8c;">(</span>query <span style="color: #008b8b;">:arg</span> <span style="color: #008b8b;">:arg2</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided <span style="color: #8c8c8c;">(</span>f1 <span style="color: #8c8c8c;">(</span>f2 <span style="color: #008b8b;">:arg</span><span style="color: #8c8c8c;">))</span> =&gt; source-tuples
                  <span style="color: #8c8c8c;">(</span>f3 <span style="color: #008b8b;">:arg2</span><span style="color: #8c8c8c;">)</span> =&gt; other-src<span style="color: #8c8c8c;">))</span>
</pre>


<p>
This fact mocks out calls to <code>(f3 :arg2)</code> and <code>(f1 (f2 :arg1))</code>, and expects that both will show up somewhere within the body of <code>(query :arg :arg2)</code>.
</p>
<p>
I prefer keywords as mocking arguments, but strings, numbers, and any symbol surrounded by dots (like <code>..this..</code>) are all valid.
</p>
</div>

</div>

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3">against-background </h4>
<div class="outline-text-4" id="text-1-5-3">


<p>
As discussed, the <code>provided</code> keyword only applies to the fact-pair directly above. it. As <code>fact?-</code> takes multiple forms, this can be limiting; What if you want to mock a function's results for all forms?
</p>
<p>
Midje solves this with <code>against-background</code>. Functions mocked within this form have lower precedence than <code>provided</code> mocking, but apply to all queries, as shown here:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8b2252;">"Same test as before, pulling mocking from against-background</span>
<span style="color: #8b2252;">        below."</span>
        short-wordcounts
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>

        <span style="color: #8b2252;">"provided overrides against-background for the query directly</span>
<span style="color: #8b2252;">        above it."</span>
        [[<span style="color: #8b2252;">"what"</span> 1] [<span style="color: #8b2252;">"a"</span> 1] [<span style="color: #8b2252;">"world!"</span> 1]]
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; [[<span style="color: #8b2252;">"what a world!"</span>]]<span style="color: #8c8c8c;">)</span>

        <span style="color: #8c8c8c;">(</span>against-background
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; short-sentences<span style="color: #8c8c8c;">))</span>
</pre>


<p>
This power allows you to explore a range of query edge cases with a single mock.
</p>
</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6">Collection Checkers </h3>
<div class="outline-text-3" id="text-1-6">


<p>
Executed queries return collections of data. <code>wc-query</code> will produce a rather large sequence of <code>&lt;word, count&gt;</code> pairs for a small number of input sentences. This is no reason to limit tests to small sentences!
</p>
<p>
Midje provides a range of collection checkers that provide you with finer control. (All collection checker options are documented <a href="https://github.com/marick/Midje/wiki/Checkers-for-collections-and-strings">here</a>.)
</p>
<p>
For the next set of facts, let's introduce a larger set of input sentences:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span><span style="color: #7f007f;">def</span> <span style="color: #0000ff;">longer-sentences</span>
  [[<span style="color: #8b2252;">"Call me Ishmael. Some years ago -- never mind how long"</span>]
   [<span style="color: #8b2252;">"precisely -- having little or no money in my purse, and"</span>]
   [<span style="color: #8b2252;">"nothing particular to interest me on shore, I thought I"</span>]
   [<span style="color: #8b2252;">"would sail about a little and see the watery part of the world."</span>]]<span style="color: #8c8c8c;">)</span>
</pre>



</div>

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1">just </h4>
<div class="outline-text-4" id="text-1-6-1">


<p>
This is the default checker for <code>midje-cascalog</code>. Bare result vectors resolve to <code>(just result-vec :in-any-order)</code>. The following two facts are eqivalent:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8c8c8c;">(</span>just [[2 3] [1 2]] <span style="color: #008b8b;">:in-any-order</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
            <span style="color: #8c8c8c;">(</span>[[1] [2]] ?a<span style="color: #8c8c8c;">)</span>
            <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">))</span>

        [[2 3] [1 2]]
        <span style="color: #8c8c8c;">(</span>&lt;- [?a ?b]
            <span style="color: #8c8c8c;">(</span>[[1] [2]] ?a<span style="color: #8c8c8c;">)</span>
            <span style="color: #8c8c8c;">(</span><span style="color: #a0522d;">inc</span> ?a <span style="color: #008b8b;">:&gt;</span> ?b<span style="color: #8c8c8c;">)))</span>
</pre>


<p>
Each of these facts checks that its subquery returns <code>[2 3]</code> <code>[1 2]</code> exclusively, in any order.
</p>
</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2">contains </h4>
<div class="outline-text-4" id="text-1-6-2">


<p>
The <code>contains</code> form, used as <code>(contains result-vec)</code>, tests that <code>result-vec</code> occurs, in order, somewhere within a query's results. The tuples in <code>result-vec</code> must be contiguous. (Using <code>contains</code> by itself really only make sense when querying for the top-n on some field, where the ordering is what's important.)
</p>
<p>
Adding the <code>:gaps-ok</code> keyword at the end of the form relaxes the contiguous requirement. Adding <code>:in-any-order</code>, or using a set for <code>result-vec</code>, relaxes the ordering restriction. For example:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8c8c8c;">(</span>contains #{[<span style="color: #8b2252;">"sail"</span> 1] [<span style="color: #8b2252;">"Ishmael."</span> 1]} <span style="color: #008b8b;">:gaps-ok</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; longer-sentences<span style="color: #8c8c8c;">))</span>
</pre>


<p>
The above fact tests that both <code>["sail" 1]</code> and <code>["Ishmael." 1]</code> appear somewhere in the results, in any order. (Note the set wrapping the result tuples.)
</p>
</div>

</div>
