org/_posts/2011-09-27-testing-cascalog-with-midje.org
*** has-prefix

=has-prefix= checks that the supplied result vector occurs at the very beginning of the query's results. Like =contains= when used without keyword arguments, =has-prefix= only makes sense with queries that return sorted tuples.

The following fact checks that =["--" 2]=, =["I" 2]= and =["and" 2]= are the top three words (by count) across all words in =longer-sentences=:

#+begin_src clojure
  (fact?- (has-prefix [["--" 2] ["I" 2] ["and" 2]])
          (-> (wc-query :text-path)
              (c/first-n 10 :sort ["?count"] :reverse true))
          (provided
            (hfs-textline :text-path) => longer-sentences))
#+end_src

*** has-suffix

*** has

** Tabular

** In Conclusion
CONCLUSION!
