_posts/2011-09-27-testing-cascalog-with-midje.html

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3">has-prefix </h4>
<div class="outline-text-4" id="text-1-6-3">


<p>
<code>has-prefix</code> checks that the supplied result vector occurs at the very beginning of the query's results. Like <code>contains</code> when used without keyword arguments, <code>has-prefix</code> only makes sense with queries that return sorted tuples.
</p>
<p>
The following fact checks that <code>["--" 2]</code>, <code>["I" 2]</code> and <code>["and" 2]</code> are the top three words (by count) across all words in <code>longer-sentences</code>:
</p>



<pre class="src src-clojure"><span style="color: #8c8c8c;">(</span>fact?- <span style="color: #8c8c8c;">(</span>has-prefix [[<span style="color: #8b2252;">"--"</span> 2] [<span style="color: #8b2252;">"I"</span> 2] [<span style="color: #8b2252;">"and"</span> 2]]<span style="color: #8c8c8c;">)</span>
        <span style="color: #8c8c8c;">(</span><span style="color: #7a378b;">-&gt;</span> <span style="color: #8c8c8c;">(</span>wc-query <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span>
            <span style="color: #8c8c8c;">(</span>c/first-n 10 <span style="color: #008b8b;">:sort</span> [<span style="color: #8b2252;">"?count"</span>] <span style="color: #008b8b;">:reverse</span> true<span style="color: #8c8c8c;">))</span>
        <span style="color: #8c8c8c;">(</span>provided
          <span style="color: #8c8c8c;">(</span>hfs-textline <span style="color: #008b8b;">:text-path</span><span style="color: #8c8c8c;">)</span> =&gt; longer-sentences<span style="color: #8c8c8c;">))</span>
</pre>

</div>
</div>
</div>
</div>
